In [1]:
import pandas as pd
import numpy as np

In [2]:
sales = pd.read_csv("sales.csv")

In [3]:
sales.head()

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   JAN  B300  VZG   20.0
2   FEB  B100  VZG    4.0
3   MAR  B100  VZG   13.0
4   JAN  B100  HYD   30.0

In [4]:
sales.shape

(10, 4)

In [5]:
sales.columns

Index(['Month', 'Book', 'City', 'Units'], dtype='object')

In [6]:
sales.index

RangeIndex(start=0, stop=10, step=1)

In [7]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Month    10 non-null object
Book     10 non-null object
City     9 non-null object
Units    9 non-null float64
dtypes: float64(1), object(3)
memory usage: 400.0+ bytes

In [8]:
sales.describe(include='all')

       Month  Book City      Units
count     10    10    9   9.000000
unique     3     3    2        NaN
top      JAN  B100  VZG        NaN
freq       4     6    5        NaN
mean     NaN   NaN  NaN  16.111111
std      NaN   NaN  NaN  12.046207
min      NaN   NaN  NaN   4.000000
25%      NaN   NaN  NaN  10.000000
50%      NaN   NaN  NaN  13.000000
75%      NaN   NaN  NaN  20.000000
max      NaN   NaN  NaN  40.000000

### selecting rows and columns

In [9]:
sales[['Month','Units']][:5]

  Month  Units
0   JAN   10.0
1   JAN   20.0
2   FEB    4.0
3   MAR   13.0
4   JAN   30.0

In [10]:
sales.loc[:4, ['Month','Units']]

  Month  Units
0   JAN   10.0
1   JAN   20.0
2   FEB    4.0
3   MAR   13.0
4   JAN   30.0

In [11]:
sales.iloc[:5, [0,3] ]

  Month  Units
0   JAN   10.0
1   JAN   20.0
2   FEB    4.0
3   MAR   13.0
4   JAN   30.0

In [12]:
sales.iloc[:3, :2]

  Month  Book
0   JAN  B100
1   JAN  B300
2   FEB  B100

In [13]:
sales.iloc[[0,4,6], [0,1,3]]

  Month  Book  Units
0   JAN  B100   10.0
4   JAN  B100   30.0
6   MAR  B100   10.0

In [14]:
sales.loc[ [1,4,7], ['Month','Units']]

  Month  Units
1   JAN   20.0
4   JAN   30.0
7   JAN   14.0

In [15]:
sales.iat[0,2]

'VZG'

In [16]:
sales.at[0,'City']

'VZG'

In [17]:
sales['Units'].mean()

16.11111111111111

In [18]:
sales.Month.unique()  # sales['Month'].unique()

array(['JAN', 'FEB', 'MAR'], dtype=object)

In [19]:
sales.dtypes

Month     object
Book      object
City      object
Units    float64
dtype: object

In [20]:
sales.sample(5)

  Month  Book City  Units
6   MAR  B100  HYD   10.0
5   FEB  B100  HYD   40.0
9   MAR  B200  NaN    4.0
4   JAN  B100  HYD   30.0
1   JAN  B300  VZG   20.0

In [21]:
sales.isin( ['JAN','VZG'])

   Month   Book   City  Units
0   True  False   True  False
1   True  False   True  False
2  False  False   True  False
3  False  False   True  False
4   True  False  False  False
5  False  False  False  False
6  False  False  False  False
7   True  False   True  False
8  False  False  False  False
9  False  False  False  False

In [22]:
sales.where( sales['Units'] < 10)

  Month  Book City  Units
0   NaN   NaN  NaN    NaN
1   NaN   NaN  NaN    NaN
2   FEB  B100  VZG    4.0
3   NaN   NaN  NaN    NaN
4   NaN   NaN  NaN    NaN
5   NaN   NaN  NaN    NaN
6   NaN   NaN  NaN    NaN
7   NaN   NaN  NaN    NaN
8   NaN   NaN  NaN    NaN
9   MAR  B200  NaN    4.0

In [23]:
sales.loc[sales['Units'] < 10]

  Month  Book City  Units
2   FEB  B100  VZG    4.0
9   MAR  B200  NaN    4.0

In [24]:
sales.nlargest(3,'Units')

  Month  Book City  Units
5   FEB  B100  HYD   40.0
4   JAN  B100  HYD   30.0
1   JAN  B300  VZG   20.0

In [25]:
sales.filter(regex='t')

  Month City  Units
0   JAN  VZG   10.0
1   JAN  VZG   20.0
2   FEB  VZG    4.0
3   MAR  VZG   13.0
4   JAN  HYD   30.0
5   FEB  HYD   40.0
6   MAR  HYD   10.0
7   JAN  VZG   14.0
8   FEB  HYD    NaN
9   MAR  NaN    4.0

In [26]:
sales.apply(lambda s: s.count(), axis=1)

0    4
1    4
2    4
3    4
4    4
5    4
6    4
7    4
8    3
9    3
dtype: int64

In [27]:
sales[ ['Month','Units']].apply(lambda s: s.count(), axis = 0)  # Column-wise

Month    10
Units     9
dtype: int64

In [28]:
sales.applymap(lambda v : f"-{v:.3}")

  Month  Book  City  Units
0  -JAN  -B10  -VZG  -10.0
1  -JAN  -B30  -VZG  -20.0
2  -FEB  -B10  -VZG   -4.0
3  -MAR  -B10  -VZG  -13.0
4  -JAN  -B10  -HYD  -30.0
5  -FEB  -B10  -HYD  -40.0
6  -MAR  -B10  -HYD  -10.0
7  -JAN  -B20  -VZG  -14.0
8  -FEB  -B20  -HYD   -nan
9  -MAR  -B20  -nan   -4.0

In [29]:
sales.Month.str.find('A')

0    1
1    1
2   -1
3    1
4    1
5   -1
6    1
7    1
8   -1
9    1
Name: Month, dtype: int64

In [30]:
sales[sales['Month'].str.startswith ('J')]

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   JAN  B300  VZG   20.0
4   JAN  B100  HYD   30.0
7   JAN  B200  VZG   14.0

In [31]:
sales.columns.str.lower()

Index(['month', 'book', 'city', 'units'], dtype='object')

### Adding and deleting rows

In [32]:
sales.append( {'Month':'MAR', 'Book' : 'B100', 'Units' : 15}, ignore_index = True)

   Month  Book City  Units
0    JAN  B100  VZG   10.0
1    JAN  B300  VZG   20.0
2    FEB  B100  VZG    4.0
3    MAR  B100  VZG   13.0
4    JAN  B100  HYD   30.0
5    FEB  B100  HYD   40.0
6    MAR  B100  HYD   10.0
7    JAN  B200  VZG   14.0
8    FEB  B200  HYD    NaN
9    MAR  B200  NaN    4.0
10   MAR  B100  NaN   15.0

In [33]:
sales.drop([0,1])

  Month  Book City  Units
2   FEB  B100  VZG    4.0
3   MAR  B100  VZG   13.0
4   JAN  B100  HYD   30.0
5   FEB  B100  HYD   40.0
6   MAR  B100  HYD   10.0
7   JAN  B200  VZG   14.0
8   FEB  B200  HYD    NaN
9   MAR  B200  NaN    4.0

In [34]:
sales.drop(columns=['Book'])

  Month City  Units
0   JAN  VZG   10.0
1   JAN  VZG   20.0
2   FEB  VZG    4.0
3   MAR  VZG   13.0
4   JAN  HYD   30.0
5   FEB  HYD   40.0
6   MAR  HYD   10.0
7   JAN  VZG   14.0
8   FEB  HYD    NaN
9   MAR  NaN    4.0

In [35]:
sales.loc[11] = {'Month':'MAR', 'Book': 'B100','City':'HYD', 'Units' : 10}

In [36]:
sales.loc[12] = ['MAR', 'B200','HYD', 20]

In [37]:
sales

   Month  Book City  Units
0    JAN  B100  VZG   10.0
1    JAN  B300  VZG   20.0
2    FEB  B100  VZG    4.0
3    MAR  B100  VZG   13.0
4    JAN  B100  HYD   30.0
5    FEB  B100  HYD   40.0
6    MAR  B100  HYD   10.0
7    JAN  B200  VZG   14.0
8    FEB  B200  HYD    NaN
9    MAR  B200  NaN    4.0
11   MAR  B100  HYD   10.0
12   MAR  B200  HYD   20.0

In [38]:
sales['Tax'] = 15

In [39]:
sales

   Month  Book City  Units  Tax
0    JAN  B100  VZG   10.0   15
1    JAN  B300  VZG   20.0   15
2    FEB  B100  VZG    4.0   15
3    MAR  B100  VZG   13.0   15
4    JAN  B100  HYD   30.0   15
5    FEB  B100  HYD   40.0   15
6    MAR  B100  HYD   10.0   15
7    JAN  B200  VZG   14.0   15
8    FEB  B200  HYD    NaN   15
9    MAR  B200  NaN    4.0   15
11   MAR  B100  HYD   10.0   15
12   MAR  B200  HYD   20.0   15

In [40]:
df1 = pd.DataFrame ( {'name' : ['A','B','C'], 'age' : [30,40,50]})
df2 = pd.DataFrame ( {'name' : ['A','B','D'], 'gender' : ['M','F','M']})

In [41]:
df1

  name  age
0    A   30
1    B   40
2    C   50

In [42]:
df2

  name gender
0    A      M
1    B      F
2    D      M

In [43]:
pd.merge(df1,df2,on='name',how='outer')   # Full outer join

  name   age gender
0    A  30.0      M
1    B  40.0      F
2    C  50.0    NaN
3    D   NaN      M

In [44]:
df1.join(df2,rsuffix='2')

  name  age name2 gender
0    A   30     A      M
1    B   40     B      F
2    C   50     D      M

In [45]:
sales.sort_index(axis=1)

    Book City Month  Tax  Units
0   B100  VZG   JAN   15   10.0
1   B300  VZG   JAN   15   20.0
2   B100  VZG   FEB   15    4.0
3   B100  VZG   MAR   15   13.0
4   B100  HYD   JAN   15   30.0
5   B100  HYD   FEB   15   40.0
6   B100  HYD   MAR   15   10.0
7   B200  VZG   JAN   15   14.0
8   B200  HYD   FEB   15    NaN
9   B200  NaN   MAR   15    4.0
11  B100  HYD   MAR   15   10.0
12  B200  HYD   MAR   15   20.0

In [46]:
df1

  name  age
0    A   30
1    B   40
2    C   50

In [47]:
df1.reset_index()

   index name  age
0      0    A   30
1      1    B   40
2      2    C   50

In [48]:
df1.set_index('name')

      age
name
A      30
B      40
C      50

In [49]:
df1

  name  age
0    A   30
1    B   40
2    C   50

In [50]:
df1

  name  age
0    A   30
1    B   40
2    C   50

In [51]:
pd.get_dummies(df1)

   age  name_A  name_B  name_C
0   30       1       0       0
1   40       0       1       0
2   50       0       0       1

In [90]:
ages = pd.Series([21,25,30,24,40,55,33,33,21,22])

In [91]:
ages.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8     True
9    False
dtype: bool

In [92]:
ages [ages.duplicated()]

7    33
8    21
dtype: int64

In [53]:
pd.cut(ages,bins=4)

0    (18.964, 28.0]
1    (18.964, 28.0]
2      (28.0, 37.0]
3    (18.964, 28.0]
4      (37.0, 46.0]
5      (46.0, 55.0]
6      (28.0, 37.0]
7      (28.0, 37.0]
8    (18.964, 28.0]
9    (18.964, 28.0]
dtype: category
Categories (4, interval[float64]): [(18.964, 28.0] < (28.0, 37.0] < (37.0, 46.0] < (46.0, 55.0]]

### Grouping

In [54]:
g = sales.groupby('Month')

In [55]:
type(g)

pandas.core.groupby.generic.DataFrameGroupBy

In [57]:
g['Units'].sum()

Month
FEB    44.0
JAN    74.0
MAR    57.0
Name: Units, dtype: float64

In [61]:
g.groups

{'FEB': Int64Index([2, 5, 8], dtype='int64'),
 'JAN': Int64Index([0, 1, 4, 7], dtype='int64'),
 'MAR': Int64Index([3, 6, 9, 11, 12], dtype='int64')}

In [65]:
for gv,rows in g:
    print(gv)
    print(rows)

FEB
  Month  Book City  Units  Tax
2   FEB  B100  VZG    4.0   15
5   FEB  B100  HYD   40.0   15
8   FEB  B200  HYD    NaN   15
JAN
  Month  Book City  Units  Tax
0   JAN  B100  VZG   10.0   15
1   JAN  B300  VZG   20.0   15
4   JAN  B100  HYD   30.0   15
7   JAN  B200  VZG   14.0   15
MAR
   Month  Book City  Units  Tax
3    MAR  B100  VZG   13.0   15
6    MAR  B100  HYD   10.0   15
9    MAR  B200  NaN    4.0   15
11   MAR  B100  HYD   10.0   15
12   MAR  B200  HYD   20.0   15

In [66]:
g.get_group('FEB')

   Book City  Units  Tax
2  B100  VZG    4.0   15
5  B100  HYD   40.0   15
8  B200  HYD    NaN   15

In [67]:
g.agg( ['mean','sum','count'])

      Units              Tax
       mean   sum count mean sum count
Month
FEB    22.0  44.0     2   15  45     3
JAN    18.5  74.0     4   15  60     4
MAR    11.4  57.0     5   15  75     5

In [76]:
total = sales['Units'].sum()
print(total)

175.0

In [85]:
gs  = sales.groupby('Month').sum()
print(gs)
print(type(gs))

       Units  Tax
Month
FEB     44.0   45
JAN     74.0   60
MAR     57.0   75
<class 'pandas.core.frame.DataFrame'>

In [82]:
gs['Ratio_To_Total'] = gs['Units'] / total

In [83]:
gs

       Units  Tax  Ratio_To_Total
Month
FEB     44.0   45        0.251429
JAN     74.0   60        0.422857
MAR     57.0   75        0.325714

In [59]:
m_c_g = sales.groupby(['Month','City'])

In [60]:
m_c_g.sum()

            Units  Tax
Month City
FEB   HYD    40.0   30
      VZG     4.0   15
JAN   HYD    30.0   15
      VZG    44.0   45
MAR   HYD    40.0   45
      VZG    13.0   15

### NA related functions

In [95]:
sales.isna().any()   # Find columns with null values

Month    False
Book     False
City      True
Units     True
Tax      False
dtype: bool

In [97]:
sales.isna().sum()   # Find how many null values are present in each column

Month    0
Book     0
City     1
Units    1
Tax      0
dtype: int64

In [100]:
sales.isna().any(axis=1)   # Find rows that have null value

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9      True
11    False
12    False
dtype: bool

In [101]:
sales[sales.isna().any(axis=1)]

  Month  Book City  Units  Tax
8   FEB  B200  HYD    NaN   15
9   MAR  B200  NaN    4.0   15

In [103]:
sales.dropna(axis=1)

   Month  Book  Tax
0    JAN  B100   15
1    JAN  B300   15
2    FEB  B100   15
3    MAR  B100   15
4    JAN  B100   15
5    FEB  B100   15
6    MAR  B100   15
7    JAN  B200   15
8    FEB  B200   15
9    MAR  B200   15
11   MAR  B100   15
12   MAR  B200   15

In [105]:
sales.fillna( {'Units': 0} )

   Month  Book City  Units  Tax
0    JAN  B100  VZG   10.0   15
1    JAN  B300  VZG   20.0   15
2    FEB  B100  VZG    4.0   15
3    MAR  B100  VZG   13.0   15
4    JAN  B100  HYD   30.0   15
5    FEB  B100  HYD   40.0   15
6    MAR  B100  HYD   10.0   15
7    JAN  B200  VZG   14.0   15
8    FEB  B200  HYD    0.0   15
9    MAR  B200  NaN    4.0   15
11   MAR  B100  HYD   10.0   15
12   MAR  B200  HYD   20.0   15

In [106]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12 entries, 0 to 12
Data columns (total 5 columns):
Month    12 non-null object
Book     12 non-null object
City     11 non-null object
Units    11 non-null float64
Tax      12 non-null int64
dtypes: float64(1), int64(1), object(3)
memory usage: 896.0+ bytes

### Write to file

In [110]:
sales.to_json("sales.json", orient='records')

In [116]:
sg = sales.groupby('Month',as_index=False).sum()

In [117]:
sg

  Month  Units  Tax
0   FEB   44.0   45
1   JAN   74.0   60
2   MAR   57.0   75

In [118]:
sg = sales.groupby('Month').sum()
sg

       Units  Tax
Month
FEB     44.0   45
JAN     74.0   60
MAR     57.0   75

In [120]:
sales.pivot_table(index='Month',columns='City',values=['Units'], aggfunc=np.sum)

      Units
City    HYD   VZG
Month
FEB    40.0   4.0
JAN    30.0  44.0
MAR    40.0  13.0